In [9]:
from sqlalchemy import create_engine, text
import pandas as pd
import psycopg2

In [10]:
database_name = 'scooters'

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [11]:
engine = create_engine(connection_string)

In [12]:
scoot = '''
SELECT companyname,
	COUNT(DISTINCT(sumdid))
FROM scooters
WHERE sumdgroup iLike 'scooter'
GROUP BY companyname;
'''

with engine.connect() as connection:
    total_scooters = pd.read_sql(text(scoot), con = connection)

total_scooters

  companyname  count
0        Bird   3860
1        Bolt    360
2      Gotcha    224
3        Jump   1210
4        Lime   1818
5        Lyft   1735
6        Spin    805

In [8]:
scoots_over_time = '''
Select companyname  AS 'Company Name',
    COUNT(DISTINCT(sumdidi))
FROM scooters
WHERE

NameError: name 'companyname' is not defined

In [ ]:
scoots2['Date and Time'] = pd.to_datetime(scooters['pub'])

In [6]:
result.fetchall()

[(datetime.date(2019, 5, 1),),
 (datetime.date(2019, 5, 1),),
 (datetime.date(2019, 5, 1),),
 (datetime.date(2019, 5, 1),),
 (datetime.date(2019, 5, 1),),
 (datetime.date(2019, 5, 1),),
 (datetime.date(2019, 5, 1),),
 (datetime.date(2019, 5, 1),),
 (datetime.date(2019, 5, 1),)]

In [7]:
import pandas as pd

In [8]:
with engine.connect() as connection:
    trips = pd.read_sql(text(query), con = connection)

trips.head()

    startdate
0  2019-05-01
1  2019-05-01
2  2019-05-01
3  2019-05-01
4  2019-05-01